spec/fixtures/inventory_request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <getInventory xmlns="http://ws.rlm.com">
      <filterXML>
&lt;ITEM_FILTER&gt;
&lt;AUTHENTICATION&gt;
&lt;USERNAME&gt;XXUSER&lt;/USERNAME&gt;
&lt;KEY_VALUE&gt;XXKEY&lt;/KEY_VALUE&gt;
&lt;/AUTHENTICATION&gt;
&lt;COMPANY_NUMBER&gt;90&lt;/COMPANY_NUMBER&gt;
&lt;DIVISION_NUMBER&gt;10&lt;/DIVISION_NUMBER&gt;
&lt;RETRIEVE_UPCS&gt;Y&lt;/RETRIEVE_UPCS&gt;
&lt;ATS_POSITIVE&gt;Y&lt;/ATS_POSITIVE&gt;
&lt;ATS_INCLUDES_WIP&gt;N&lt;/ATS_INCLUDES_WIP&gt;
&lt;/ITEM_FILTER&gt;
</filterXML>
    </getInventory>
  </Body>
</Envelope>
